## Introduction to Pandas

**pandas** is a Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python. Additionally, it has the broader goal of becoming **the most powerful and flexible open source data analysis / manipulation tool available in any language**. It is already well on its way toward this goal.

pandas is well suited for many different kinds of data:
* Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
* Ordered and unordered (not necessarily fixed-frequency) time series data.
* Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels
* Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure

The two primary data structures of pandas - *Series* (1-dimensional) and *DataFrame* (2-dimensional), handle the vast majority of typical use cases in finance, statistics, social science, and many areas of engineering. For R users, DataFrame provides everything that R’s data.frame provides and much more. pandas is built on top of NumPy and is intended to integrate well within a scientific computing environment with many other 3rd party libraries.

Here are just a few of the things that pandas does well:
* Easy handling of missing data (represented as NaN) in floating point as well as non-floating point data
* Size mutability: columns can be inserted and deleted from DataFrame and higher dimensional objects
* Powerful, flexible group by functionality to perform split-apply-combine operations on data sets, for both aggregating and transforming data
* Intelligent label-based slicing, fancy indexing, and subsetting of large data sets
* Intuitive merging and joining data sets
* Flexible reshaping and pivoting of data sets
* Robust IO tools for loading data from flat files (CSV and delimited), Excel files, databases, and saving / loading data from the ultrafast HDF5 format
* Time series-specific functionality: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging, etc.

Many of these principles are here to address the shortcomings frequently experienced using other languages / scientific research environments. For data scientists, working with data is typically divided into multiple stages: munging and cleaning data, analyzing / modeling it, then organizing the results of the analysis into a form suitable for plotting or tabular display. pandas is the ideal tool for all of these tasks.

Some other notes
* **pandas** is fast. Many of the low-level algorithmic bits have been extensively tweaked in Cython code. However, as with anything else generalization usually sacrifices performance. So if you focus on one feature for your application you may be able to create a faster specialized tool.
* pandas is a dependency of statsmodels, making it an important part of the statistical computing ecosystem in Python.
* pandas has been used extensively in production in financial applications.

<br>

## Representation

All data is loaded directly into the RAM and is optimised to use memory efficiently. The data in memory can be thought of as below:

| column1 | column2 | Gender |
| -------- | -------- | -------- |
| Allen | Varghese | Male |
| Kevin | O'Brien | Male |
| Mihai | Todor | Male |


The main data structure in **pandas** is **DataFrame** which manages data in the above format and is accessible for computation as a python **dictionary**. Lets create the above information as a pandas dataframe.

In [1]:
import pandas as pd

In [2]:
# Create a python dictionary
data = {
    "column1": ["Allen", "Kevin", "Mihai"],
    "column2": ["Varghese", "O'Brien", "Todor"],
    "Gender": ["Male", "Male", "Male"],
    "some_random_numbers": [4200, 2750, 3820]
}

# Create the DataFrame
df = pd.DataFrame(data)
df

  column1   column2 Gender  some_random_numbers
0   Allen  Varghese   Male                 4200
1   Kevin   O'Brien   Male                 2750
2   Mihai     Todor   Male                 3820

An `index` column is added automatically by pandas. This is to keep track of rows and for fast manipulation of data by easy slicing. Individual rows can be accessed by the index.

In [3]:
df.loc[1]

column1                  Kevin
column2                O'Brien
Gender                    Male
some_random_numbers       2750
Name: 1, dtype: object

In [4]:
df["column1"]

0    Allen
1    Kevin
2    Mihai
Name: column1, dtype: object

In [5]:
# Convert to a Numpy array
df["column1"].values

array(['Allen', 'Kevin', 'Mihai'], dtype=object)

In [6]:
# Convert to a Python list
df["column1"].tolist()

['Allen', 'Kevin', 'Mihai']

**NOTE:** Data in a pandas DataFrame is linked as a collection of columns rather than a collection of rows. Thus it is very
fast to access and manipulate data in columns rather than rows. It is important to use appropriate data modelling
techniques to convert available data into a more accessible format

<br>

## Inspecting DataFrames

Below are some useful DataFrame inspection functions

In [7]:
# Summary of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   column1              3 non-null      object
 1   column2              3 non-null      object
 2   Gender               3 non-null      object
 3   some_random_numbers  3 non-null      int64
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [8]:
# Get the columns
df.columns

Index(['column1', 'column2', 'Gender', 'some_random_numbers'], dtype='object')

In [9]:
# Get the columns as a Python list
df.columns.tolist()

['column1', 'column2', 'Gender', 'some_random_numbers']

In [10]:
# You can also use the Python function `list`
list(df.columns)

['column1', 'column2', 'Gender', 'some_random_numbers']

In [11]:
# Get the index
df.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
# Sneak peek. Displays the first 5 rows by default
df.head()

  column1   column2 Gender  some_random_numbers
0   Allen  Varghese   Male                 4200
1   Kevin   O'Brien   Male                 2750
2   Mihai     Todor   Male                 3820

In [13]:
# Summary Statistics
df.describe()

       some_random_numbers
count             3.000000
mean           3590.000000
std             751.864349
min            2750.000000
25%            3285.000000
50%            3820.000000
75%            4010.000000
max            4200.000000

In [14]:
# Extract a specific row
df.describe().loc["25%"]

some_random_numbers    3285.0
Name: 25%, dtype: float64

In [15]:
# Include all the columns in the summary
df.describe(include="all")

       column1 column2 Gender  some_random_numbers
count        3       3      3             3.000000
unique       3       3      1                  NaN
top      Allen   Todor   Male                  NaN
freq         1       1      3                  NaN
mean       NaN     NaN    NaN          3590.000000
std        NaN     NaN    NaN           751.864349
min        NaN     NaN    NaN          2750.000000
25%        NaN     NaN    NaN          3285.000000
50%        NaN     NaN    NaN          3820.000000
75%        NaN     NaN    NaN          4010.000000
max        NaN     NaN    NaN          4200.000000

In [16]:
# Custom percentile list
df.describe(percentiles=[0.10, 0.20, 0.30, 0.40, 0.50, 0.60, 0.70, 0.80, 0.90, 0.99, 0.999])

       some_random_numbers
count             3.000000
mean           3590.000000
std             751.864349
min            2750.000000
10%            2964.000000
20%            3178.000000
30%            3392.000000
40%            3606.000000
50%            3820.000000
60%            3896.000000
70%            3972.000000
80%            4048.000000
90%            4124.000000
99%            4192.400000
99.9%          4199.240000
max            4200.000000

In [17]:
# Display the first row
df.head(1)

  column1   column2 Gender  some_random_numbers
0   Allen  Varghese   Male                 4200

In [18]:
# Display the last row
df.tail(1)

  column1 column2 Gender  some_random_numbers
2   Mihai   Todor   Male                 3820

In [19]:
# Number of rows in a DataFrame
len(df)

3

For looking up details about a DataFrame or a function use "dir" or "help"

In [20]:
dir(df)

['Gender',
 'T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_box_col_values',
 '_box_item_values',
 '_builtin_table',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_frame',
 '_combine_match_index',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_type',
 '_ensure_valid_index',
 '_find_valid_index',
 '_from_arrays',
 '_from_axes',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_iget_item_cache',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_internal_get_values',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_datelike_mixed_type',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_join_compat',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_setup_axes',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'column1',
 'column2',
 'columns',
 'combine',
 'combine_first',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'some_random_numbers',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

In [21]:
help(df.loc)

Help on _LocIndexer in module pandas.core.indexing object:

class _LocIndexer(_LocationIndexer)
 |  Access a group of rows and columns by label(s) or a boolean array.
 |
 |  ``.loc[]`` is primarily label based, but may also be used with a
 |  boolean array.
 |
 |  Allowed inputs are:
 |
 |  - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
 |    interpreted as a *label* of the index, and **never** as an
 |    integer position along the index).
 |  - A list or array of labels, e.g. ``['a', 'b', 'c']``.
 |  - A slice object with labels, e.g. ``'a':'f'``.
 |
 |    .. warning:: Note that contrary to usual python slices, **both** the
 |        start and the stop are included
 |
 |  - A boolean array of the same length as the axis being sliced,
 |    e.g. ``[True, False, True]``.
 |  - A ``callable`` function with one argument (the calling Series or
 |    DataFrame) and that returns valid output for indexing (one of the above)
 |
 |  See more at :ref:`Selection by Label <indexing.label>`
 |
 |  Raises
 |  ------
 |  KeyError
 |      If any items are not found.
 |
 |  See Also
 |  --------
 |  DataFrame.at : Access a single value for a row/column label pair.
 |  DataFrame.iloc : Access group of rows and columns by integer position(s).
 |  DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
 |      Series/DataFrame.
 |  Series.loc : Access group of values using labels.
 |
 |  Examples
 |  --------
 |  **Getting values**
 |
 |  >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
 |  ...      index=['cobra', 'viper', 'sidewinder'],
 |  ...      columns=['max_speed', 'shield'])
 |  >>> df
 |              max_speed  shield
 |  cobra               1       2
 |  viper               4       5
 |  sidewinder          7       8
 |
 |  Single label. Note this returns the row as a Series.
 |
 |  >>> df.loc['viper']
 |  max_speed    4
 |  shield       5
 |  Name: viper, dtype: int64
 |
 |  List of labels. Note using ``[[]]`` returns a DataFrame.
 |
 |  >>> df.loc[['viper', 'sidewinder']]
 |              max_speed  shield
 |  viper               4       5
 |  sidewinder          7       8
 |
 |  Single label for row and column
 |
 |  >>> df.loc['cobra', 'shield']
 |  2
 |
 |  Slice with labels for row and single label for column. As mentioned
 |  above, note that both the start and stop of the slice are included.
 |
 |  >>> df.loc['cobra':'viper', 'max_speed']
 |  cobra    1
 |  viper    4
 |  Name: max_speed, dtype: int64
 |
 |  Boolean list with the same length as the row axis
 |
 |  >>> df.loc[[False, False, True]]
 |              max_speed  shield
 |  sidewinder          7       8
 |
 |  Conditional that returns a boolean Series
 |
 |  >>> df.loc[df['shield'] > 6]
 |              max_speed  shield
 |  sidewinder          7       8
 |
 |  Conditional that returns a boolean Series with column labels specified
 |
 |  >>> df.loc[df['shield'] > 6, ['max_speed']]
 |              max_speed
 |  sidewinder          7
 |
 |  Callable that returns a boolean Series
 |
 |  >>> df.loc[lambda df: df['shield'] == 8]
 |              max_speed  shield
 |  sidewinder          7       8
 |
 |  **Setting values**
 |
 |  Set value for all items matching the list of labels
 |
 |  >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
 |  >>> df
 |              max_speed  shield
 |  cobra               1       2
 |  viper               4      50
 |  sidewinder          7      50
 |
 |  Set value for an entire row
 |
 |  >>> df.loc['cobra'] = 10
 |  >>> df
 |              max_speed  shield
 |  cobra              10      10
 |  viper               4      50
 |  sidewinder          7      50
 |
 |  Set value for an entire column
 |
 |  >>> df.loc[:, 'max_speed'] = 30
 |  >>> df
 |              max_speed  shield
 |  cobra              30      10
 |  viper              30      50
 |  sidewinder         30      50
 |
 |  Set value for rows matching callable condition
 |
 |  >>> df.loc[df['shield'] > 35] = 0
 |  >>> df
 |              max_speed  shield
 |  cobra              30      10
 |  viper               0       0
 |  sidewinder          0       0
 |
 |  **Getting values on a DataFrame with an index that has integer labels**
 |
 |  Another example using integers for the index
 |
 |  >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
 |  ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
 |  >>> df
 |     max_speed  shield
 |  7          1       2
 |  8          4       5
 |  9          7       8
 |
 |  Slice with integer labels for rows. As mentioned above, note that both
 |  the start and stop of the slice are included.
 |
 |  >>> df.loc[7:9]
 |     max_speed  shield
 |  7          1       2
 |  8          4       5
 |  9          7       8
 |
 |  **Getting values with a MultiIndex**
 |
 |  A number of examples using a DataFrame with a MultiIndex
 |
 |  >>> tuples = [
 |  ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
 |  ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
 |  ...    ('viper', 'mark ii'), ('viper', 'mark iii')
 |  ... ]
 |  >>> index = pd.MultiIndex.from_tuples(tuples)
 |  >>> values = [[12, 2], [0, 4], [10, 20],
 |  ...         [1, 4], [7, 1], [16, 36]]
 |  >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
 |  >>> df
 |                       max_speed  shield
 |  cobra      mark i           12       2
 |             mark ii           0       4
 |  sidewinder mark i           10      20
 |             mark ii           1       4
 |  viper      mark ii           7       1
 |             mark iii         16      36
 |
 |  Single label. Note this returns a DataFrame with a single index.
 |
 |  >>> df.loc['cobra']
 |           max_speed  shield
 |  mark i          12       2
 |  mark ii          0       4
 |
 |  Single index tuple. Note this returns a Series.
 |
 |  >>> df.loc[('cobra', 'mark ii')]
 |  max_speed    0
 |  shield       4
 |  Name: (cobra, mark ii), dtype: int64
 |
 |  Single label for row and column. Similar to passing in a tuple, this
 |  returns a Series.
 |
 |  >>> df.loc['cobra', 'mark i']
 |  max_speed    12
 |  shield        2
 |  Name: (cobra, mark i), dtype: int64
 |
 |  Single tuple. Note using ``[[]]`` returns a DataFrame.
 |
 |  >>> df.loc[[('cobra', 'mark ii')]]
 |                 max_speed  shield
 |  cobra mark ii          0       4
 |
 |  Single tuple for the index with a single label for the column
 |
 |  >>> df.loc[('cobra', 'mark i'), 'shield']
 |  2
 |
 |  Slice from index tuple to single label
 |
 |  >>> df.loc[('cobra', 'mark i'):'viper']
 |                       max_speed  shield
 |  cobra      mark i           12       2
 |             mark ii           0       4
 |  sidewinder mark i           10      20
 |             mark ii           1       4
 |  viper      mark ii           7       1
 |             mark iii         16      36
 |
 |  Slice from index tuple to index tuple
 |
 |  >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
 |                      max_speed  shield
 |  cobra      mark i          12       2
 |             mark ii          0       4
 |  sidewinder mark i          10      20
 |             mark ii          1       4
 |  viper      mark ii          7       1
 |
 |  Method resolution order:
 |      _LocIndexer
 |      _LocationIndexer
 |      _NDFrameIndexer
 |      pandas._libs.indexing._NDFrameIndexerBase
 |      builtins.object
 |
 |  Methods inherited from _LocationIndexer:
 |
 |  __getitem__(self, key)
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from _NDFrameIndexer:
 |
 |  __call__(self, axis=None)
 |      Call self as a function.
 |
 |  __setitem__(self, key, value)
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _NDFrameIndexer:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _NDFrameIndexer:
 |
 |  __annotations__ = {'_valid_types': <class 'str'>}
 |
 |  axis = None
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  __init__(self, /, *args, **kwargs)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  __reduce__ = __reduce_cython__(...)
 |
 |  __setstate__ = __setstate_cython__(...)
 |
 |  ----------------------------------------------------------------------
 |  Static methods inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  name
 |
 |  ndim
 |
 |  obj

<br>

## Manipulating Data

Adding and removing columns from a DataFrame can be done on the fly and makes data manipulation very easy

In [22]:
df

  column1   column2 Gender  some_random_numbers
0   Allen  Varghese   Male                 4200
1   Kevin   O'Brien   Male                 2750
2   Mihai     Todor   Male                 3820

In [23]:
# Assigning a new column by using an equal length Python list
# assigned to a new column
df["Location"] = ["Dublin", "Limerick", "Dublin"]
df

  column1   column2 Gender  some_random_numbers  Location
0   Allen  Varghese   Male                 4200    Dublin
1   Kevin   O'Brien   Male                 2750  Limerick
2   Mihai     Todor   Male                 3820    Dublin

In [24]:
# A subset of columns can be extracted from a DataFrame to remove extra columns
name_df = df[["column1", "column2"]]
name_df

  column1   column2
0   Allen  Varghese
1   Kevin   O'Brien
2   Mihai     Todor

In [25]:
# Rename columns
name_df = name_df.rename(
    columns={
        "column1": "First Name",
        "column2": "Last Name"
    }
)
name_df

  First Name Last Name
0      Allen  Varghese
1      Kevin   O'Brien
2      Mihai     Todor

In [26]:
# Extract the 1st letter of first name
name_df["FN_1"] = name_df["First Name"].map(lambda x: x[0])
name_df

  First Name Last Name FN_1
0      Allen  Varghese    A
1      Kevin   O'Brien    K
2      Mihai     Todor    M

In [27]:
# TODO: Extract the last 3 letters of Last Name in a new column "LN_3"
name_df["LN_3"] = name_df["Last Name"].map(lambda x: x[-3:])
name_df

  First Name Last Name FN_1 LN_3
0      Allen  Varghese    A  ese
1      Kevin   O'Brien    K  ien
2      Mihai     Todor    M  dor

### Load Data

Data can be loaded from external sources like CSV files, Excel and databases.

In [28]:
csv_df = pd.read_csv("datasets/weather_2012.csv")
csv_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8784 entries, 0 to 8783
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date/Time           8784 non-null   object
 1   Temp (C)            8784 non-null   float64
 2   Dew Point Temp (C)  8784 non-null   float64
 3   Rel Hum (%)         8784 non-null   int64
 4   Wind Spd (km/h)     8784 non-null   int64
 5   Visibility (km)     8784 non-null   float64
 6   Stn Press (kPa)     8784 non-null   float64
 7   Weather             8784 non-null   object
dtypes: float64(4), int64(2), object(2)
memory usage: 549.1+ KB

In [29]:
csv_df.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog"
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog

In [30]:
csv_df["Weather"].unique()

array(['Fog', 'Freezing Drizzle,Fog', 'Mostly Cloudy', 'Cloudy', 'Rain',
       'Rain Showers', 'Mainly Clear', 'Snow Showers', 'Snow', 'Clear',
       'Freezing Rain,Fog', 'Freezing Rain', 'Freezing Drizzle',
       'Rain,Snow', 'Moderate Snow', 'Freezing Drizzle,Snow',
       'Freezing Rain,Snow Grains', 'Snow,Blowing Snow', 'Freezing Fog',
       'Haze', 'Rain,Fog', 'Drizzle,Fog', 'Drizzle',
       'Freezing Drizzle,Haze', 'Freezing Rain,Haze', 'Snow,Haze',
       'Snow,Fog', 'Snow,Ice Pellets', 'Rain,Haze', 'Thunderstorms,Rain',
       'Thunderstorms,Rain Showers', 'Thunderstorms,Heavy Rain Showers',
       'Thunderstorms,Rain Showers,Fog', 'Thunderstorms',
       'Thunderstorms,Rain,Fog',
       'Thunderstorms,Moderate Rain Showers,Fog', 'Rain Showers,Fog',
       'Rain Showers,Snow Showers', 'Snow Pellets', 'Rain,Snow,Fog',
       'Moderate Rain,Fog', 'Freezing Rain,Ice Pellets,Fog',
       'Drizzle,Ice Pellets,Fog', 'Drizzle,Snow', 'Rain,Ice Pellets',
       'Drizzle,Snow,Fog', 'Rain,Snow Grains', 'Rain,Snow,Ice Pellets',
       'Snow Showers,Fog', 'Moderate Snow,Blowing Snow'], dtype=object)

<br>

## Filtering data

In [31]:
csv_df["Weather"].str.contains("Rain")

0       False
1       False
2       False
3       False
4       False
        ...
8779    False
8780    False
8781    False
8782    False
8783    False
Name: Weather, Length: 8784, dtype: bool

In [32]:
csv_df["Weather"][csv_df["Weather"].str.contains("Rain")]

18                   Rain
19                   Rain
22           Rain Showers
24           Rain Showers
153     Freezing Rain,Fog
              ...
8537                 Rain
8538                 Rain
8539                 Rain
8540                 Rain
8541                 Rain
Name: Weather, Length: 689, dtype: object

In [33]:
csv_df["Weather"][csv_df["Weather"].str.contains("Rain")].head(1)

18    Rain
Name: Weather, dtype: object

In [34]:
# Find only "Rain" weather reports
csv_df["Weather"][csv_df["Weather"].str.contains("Rain")].unique()

array(['Rain', 'Rain Showers', 'Freezing Rain,Fog', 'Freezing Rain',
       'Rain,Snow', 'Freezing Rain,Snow Grains', 'Rain,Fog',
       'Freezing Rain,Haze', 'Rain,Haze', 'Thunderstorms,Rain',
       'Thunderstorms,Rain Showers', 'Thunderstorms,Heavy Rain Showers',
       'Thunderstorms,Rain Showers,Fog', 'Thunderstorms,Rain,Fog',
       'Thunderstorms,Moderate Rain Showers,Fog', 'Rain Showers,Fog',
       'Rain Showers,Snow Showers', 'Rain,Snow,Fog', 'Moderate Rain,Fog',
       'Freezing Rain,Ice Pellets,Fog', 'Rain,Ice Pellets',
       'Rain,Snow Grains', 'Rain,Snow,Ice Pellets'], dtype=object)

In [35]:
# Find rows that has weather value as "Fog"
csv_df[csv_df["Weather"] == "Fog"]

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog
5,2012-01-01 05:00:00,-1.4,-3.3,87,9,6.4,101.27,Fog
6,2012-01-01 06:00:00,-1.5,-3.1,89,7,6.4,101.29,Fog
...,...,...,...,...,...,...,...,...
8716,2012-12-29 04:00:00,-16.0,-17.2,90,6,9.7,101.25,Fog
8717,2012-12-29 05:00:00,-14.8,-15.9,91,4,6.4,101.25,Fog
8718,2012-12-29 06:00:00,-13.8,-15.3,88,4,9.7,101.25,Fog
8719,2012-12-29 07:00:00,-14.8,-16.4,88,7,8.0,101.22,Fog
8722,2012-12-29 10:00:00,-12.0,-13.3,90,7,6.4,101.15,Fog

In [36]:
# Find rows where temperature is more than 10 deg C
csv_df[csv_df["Temp (C)"] > 10.0]

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
1600,2012-03-07 16:00:00,11.4,-2.3,38,15,24.1,101.31,Mostly Cloudy
1611,2012-03-08 03:00:00,10.1,-0.9,46,24,25.0,100.69,Mostly Cloudy
1615,2012-03-08 07:00:00,10.3,0.8,52,26,48.3,100.47,Cloudy
1617,2012-03-08 09:00:00,10.2,1.6,55,26,48.3,100.29,Cloudy
1618,2012-03-08 10:00:00,12.1,2.9,53,30,24.1,100.22,Cloudy
...,...,...,...,...,...,...,...,...
8128,2012-12-04 16:00:00,10.7,7.9,83,24,19.3,100.64,Cloudy
8129,2012-12-04 17:00:00,10.8,8.1,83,30,25.0,100.55,Cloudy
8130,2012-12-04 18:00:00,10.7,8.2,85,32,25.0,100.50,Cloudy
8131,2012-12-04 19:00:00,10.7,8.4,86,7,25.0,100.57,Rain Showers
8133,2012-12-04 21:00:00,10.4,9.7,95,9,6.4,100.56,Rain

In [37]:
# Find rows where temperature is more than 10 deg C and Weather is either `Cloudy` or `Clear`
csv_df[(csv_df["Temp (C)"] > 10.0) & (csv_df["Weather"].isin(["Cloudy", "Clear"]))]

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
1615,2012-03-08 07:00:00,10.3,0.8,52,26,48.3,100.47,Cloudy
1617,2012-03-08 09:00:00,10.2,1.6,55,26,48.3,100.29,Cloudy
1618,2012-03-08 10:00:00,12.1,2.9,53,30,24.1,100.22,Cloudy
1619,2012-03-08 11:00:00,12.7,3.8,55,26,24.1,100.13,Cloudy
1621,2012-03-08 13:00:00,11.5,5.2,65,20,24.1,99.99,Cloudy
...,...,...,...,...,...,...,...,...
8126,2012-12-04 14:00:00,11.3,8.1,81,24,24.1,100.74,Cloudy
8127,2012-12-04 15:00:00,11.0,7.9,81,24,24.1,100.66,Cloudy
8128,2012-12-04 16:00:00,10.7,7.9,83,24,19.3,100.64,Cloudy
8129,2012-12-04 17:00:00,10.8,8.1,83,30,25.0,100.55,Cloudy
8130,2012-12-04 18:00:00,10.7,8.2,85,32,25.0,100.50,Cloudy

In [38]:
# Group by on "Weather" column and count the number of records for each category
weather_grpby = csv_df.groupby("Weather")["Dew Point Temp (C)"].count()
weather_grpby

Weather
Clear                                      1326
Cloudy                                     1728
Drizzle                                      41
Drizzle,Fog                                  80
Drizzle,Ice Pellets,Fog                       1
Drizzle,Snow                                  2
Drizzle,Snow,Fog                             15
Fog                                         150
Freezing Drizzle                              7
Freezing Drizzle,Fog                          6
Freezing Drizzle,Haze                         3
Freezing Drizzle,Snow                        11
Freezing Fog                                  4
Freezing Rain                                14
Freezing Rain,Fog                             4
Freezing Rain,Haze                            2
Freezing Rain,Ice Pellets,Fog                 1
Freezing Rain,Snow Grains                     1
Haze                                         16
Mainly Clear                               2106
Moderate Rain,Fog                             1
Moderate Snow                                 4
Moderate Snow,Blowing Snow                    2
Mostly Cloudy                              2069
Rain                                        306
Rain Showers                                188
Rain Showers,Fog                              1
Rain Showers,Snow Showers                     2
Rain,Fog                                    116
Rain,Haze                                     3
Rain,Ice Pellets                              1
Rain,Snow                                    18
Rain,Snow Grains                              1
Rain,Snow,Fog                                 1
Rain,Snow,Ice Pellets                         4
Snow                                        390
Snow Pellets                                  1
Snow Showers                                 60
Snow Showers,Fog                              4
Snow,Blowing Snow                            19
Snow,Fog                                     37
Snow,Haze                                     5
Snow,Ice Pellets                              6
Thunderstorms                                 2
Thunderstorms,Heavy Rain Showers              1
Thunderstorms,Moderate Rain Showers,Fog       1
Thunderstorms,Rain                            3
Thunderstorms,Rain Showers                   16
Thunderstorms,Rain Showers,Fog                3
Thunderstorms,Rain,Fog                        1
Name: Dew Point Temp (C), dtype: int64

The above output is a Series with the unique values in the `Weather` column.

In [39]:
# Get the output of a group by condition as a Dataframe
weather_grpby = csv_df.groupby("Weather", as_index=False)["Dew Point Temp (C)"].count()
weather_grpby

                                    Weather  Dew Point Temp (C)
0                                     Clear                1326
1                                    Cloudy                1728
2                                   Drizzle                  41
3                               Drizzle,Fog                  80
4                   Drizzle,Ice Pellets,Fog                   1
5                              Drizzle,Snow                   2
6                          Drizzle,Snow,Fog                  15
7                                       Fog                 150
8                          Freezing Drizzle                   7
9                      Freezing Drizzle,Fog                   6
10                    Freezing Drizzle,Haze                   3
11                    Freezing Drizzle,Snow                  11
12                             Freezing Fog                   4
13                            Freezing Rain                  14
14                        Freezing Rain,Fog                   4
15                       Freezing Rain,Haze                   2
16            Freezing Rain,Ice Pellets,Fog                   1
17                Freezing Rain,Snow Grains                   1
18                                     Haze                  16
19                             Mainly Clear                2106
20                        Moderate Rain,Fog                   1
21                            Moderate Snow                   4
22               Moderate Snow,Blowing Snow                   2
23                            Mostly Cloudy                2069
24                                     Rain                 306
25                             Rain Showers                 188
26                         Rain Showers,Fog                   1
27                Rain Showers,Snow Showers                   2
28                                 Rain,Fog                 116
29                                Rain,Haze                   3
30                         Rain,Ice Pellets                   1
31                                Rain,Snow                  18
32                         Rain,Snow Grains                   1
33                            Rain,Snow,Fog                   1
34                    Rain,Snow,Ice Pellets                   4
35                                     Snow                 390
36                             Snow Pellets                   1
37                             Snow Showers                  60
38                         Snow Showers,Fog                   4
39                        Snow,Blowing Snow                  19
40                                 Snow,Fog                  37
41                                Snow,Haze                   5
42                         Snow,Ice Pellets                   6
43                            Thunderstorms                   2
44         Thunderstorms,Heavy Rain Showers                   1
45  Thunderstorms,Moderate Rain Showers,Fog                   1
46                       Thunderstorms,Rain                   3
47               Thunderstorms,Rain Showers                  16
48           Thunderstorms,Rain Showers,Fog                   3
49                   Thunderstorms,Rain,Fog                   1

Inspect a dataset about bikes in Motreal (data in French) that has :
* non-typical formatting of CSV data
* different character set encoding
* a date column as the index field

Source : http://donnees.ville.montreal.qc.ca/dataset/velos-comptage

In [40]:
bikes = pd.read_csv(
    'datasets/bikes.csv', sep=';', encoding='latin1',
    parse_dates=['Date'], dayfirst=True, index_col='Date'
)
bikes.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 310 entries, 2012-01-01 to 2012-11-05
Data columns (total 9 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   Berri 1                              310 non-null    int64
 1   Brébeuf (données non disponibles)    0 non-null      float64
 2   Côte-Sainte-Catherine                310 non-null    int64
 3   Maisonneuve 1                        310 non-null    int64
 4   Maisonneuve 2                        310 non-null    int64
 5   du Parc                              310 non-null    int64
 6   Pierre-Dupuy                         310 non-null    int64
 7   Rachel1                              310 non-null    int64
 8   St-Urbain (données non disponibles)  0 non-null      float64
dtypes: float64(2), int64(7)
memory usage: 24.2 KB

In [41]:
bikes.head()

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,NaN,0,38,51,26,10,16,NaN
2012-01-02,83,NaN,1,68,153,53,6,43,NaN
2012-01-03,135,NaN,2,104,248,89,3,58,NaN
2012-01-04,144,NaN,1,116,318,111,8,61,NaN
2012-01-05,197,NaN,2,124,330,97,13,95,NaN

In [42]:
# Make a copy of only the "Berri 1" data
berri_bikes = bikes[['Berri 1']].copy()
berri_bikes.head()

            Berri 1
Date
2012-01-01       35
2012-01-02       83
2012-01-03      135
2012-01-04      144
2012-01-05      197

Next, we need to add a 'weekday' column. Firstly, we can get the weekday from the index. It's basically all the days of the year. Pandas has a bunch of really great time series functionality, so if we wanted to get the day of the month for each row, we could do it like this:

In [43]:
berri_bikes.index.day

Int64Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
            ...
            27, 28, 29, 30, 31,  1,  2,  3,  4,  5],
           dtype='int64', name='Date', length=310)

We actually want the weekday, though:

In [44]:
berri_bikes.index.weekday

Int64Index([6, 0, 1, 2, 3, 4, 5, 6, 0, 1,
            ...
            5, 6, 0, 1, 2, 3, 4, 5, 6, 0],
           dtype='int64', name='Date', length=310)

These are the days of the week, where 0 is Monday. I found out that 0 was Monday by checking on a calendar.
Now that we know how to get the weekday, we can add it as a column in our dataframe like this:

In [45]:
#berri_bikes.loc[:,'weekday'] = berri_bikes.index.weekday
berri_bikes["weekday"] = berri_bikes.index.weekday

#berri_bikes[:5]
berri_bikes.head()

            Berri 1  weekday
Date
2012-01-01       35        6
2012-01-02       83        0
2012-01-03      135        1
2012-01-04      144        2
2012-01-05      197        3

Adding up cyclists by weekday

In [46]:
weekday_counts = berri_bikes.groupby('weekday').sum()
weekday_counts

         Berri 1
weekday
0         134298
1         135305
2         152972
3         160131
4         141771
5         101578
6          99310

It's hard to remember what 0, 1, 2, 3, 4, 5, 6 mean, so we can fix it up with corresponding labels:

In [47]:
weekday_counts.index = [
    'Monday', 'Tuesday', 'Wednesday', 'Thursday',
    'Friday', 'Saturday', 'Sunday'
]
weekday_counts

           Berri 1
Monday      134298
Tuesday     135305
Wednesday   152972
Thursday    160131
Friday      141771
Saturday    101578
Sunday       99310

In [48]:
# TODO: Repeat the above exercise with Month

In [49]:
berri_bikes.index.month

Int64Index([ 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
            ...
            10, 10, 10, 10, 10, 11, 11, 11, 11, 11],
           dtype='int64', name='Date', length=310)

In [50]:
berri_bikes["month"] = berri_bikes.index.month
berri_bikes

            Berri 1  weekday  month
Date
2012-01-01       35        6      1
2012-01-02       83        0      1
2012-01-03      135        1      1
2012-01-04      144        2      1
2012-01-05      197        3      1
...             ...      ...    ...
2012-11-01     2405        3     11
2012-11-02     1582        4     11
2012-11-03      844        5     11
2012-11-04      966        6     11
2012-11-05     2247        0     11

[310 rows x 3 columns]

In [51]:
month_counts = berri_bikes.groupby("month").sum()
month_counts

       Berri 1  weekday
month
1         4915       91
2         6712       86
3        26229       96
4        67699       90
5       133274       90
6       144849       93
7       162562       91
8       149227       93
9       127061       95
10       94793       87
11        8044       18

In [52]:
month_counts.index = [
    "January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November"
]
month_counts

           Berri 1  weekday
January       4915       91
February      6712       86
March        26229       96
April        67699       90
May         133274       90
June        144849       93
July        162562       91
August      149227       93
September   127061       95
October      94793       87
November      8044       18

In [53]:
# Multi-level index which involves accessing a row based on multiple columns
groupby_date_month_weekday = berri_bikes.groupby(['Date', 'month', 'weekday']).sum()
groupby_date_month_weekday

                          Berri 1
Date       month weekday
2012-01-01 1     6             35
2012-01-02 1     0             83
2012-01-03 1     1            135
2012-01-04 1     2            144
2012-01-05 1     3            197
...                           ...
2012-11-01 11    3           2405
2012-11-02 11    4           1582
2012-11-03 11    5            844
2012-11-04 11    6            966
2012-11-05 11    0           2247

[310 rows x 1 columns]

In [54]:
# The multiple columns as an index is represented as a tuple
groupby_date_month_weekday.index

MultiIndex([('2012-01-01',  1, 6),
            ('2012-01-02',  1, 0),
            ('2012-01-03',  1, 1),
            ('2012-01-04',  1, 2),
            ('2012-01-05',  1, 3),
            ('2012-01-06',  1, 4),
            ('2012-01-07',  1, 5),
            ('2012-01-08',  1, 6),
            ('2012-01-09',  1, 0),
            ('2012-01-10',  1, 1),
            ...
            ('2012-10-27', 10, 5),
            ('2012-10-28', 10, 6),
            ('2012-10-29', 10, 0),
            ('2012-10-30', 10, 1),
            ('2012-10-31', 10, 2),
            ('2012-11-01', 11, 3),
            ('2012-11-02', 11, 4),
            ('2012-11-03', 11, 5),
            ('2012-11-04', 11, 6),
            ('2012-11-05', 11, 0)],
           names=['Date', 'month', 'weekday'], length=310)

In [55]:
# Accessing a row using just 1 column
groupby_date_month_weekday.loc[('2012-01-07')]

                          Berri 1
Date       month weekday
2012-01-07 1     5             98

In [56]:
# Accessing a row using 2 columns
groupby_date_month_weekday.loc[('2012-01-07', 1)]

         Berri 1
weekday
5             98

In [57]:
# Accessing a row using all 3 columns
groupby_date_month_weekday.loc[('2012-01-07', 1, 5)]

Berri 1    98
Name: (2012-01-07 00:00:00, 1, 5), dtype: int64

In [58]:
# Display all levels for the multi-index
groupby_date_month_weekday.index.levels

FrozenList([[2012-01-01 00:00:00, 2012-01-02 00:00:00, 2012-01-03 00:00:00, 2012-01-04 00:00:00, 2012-01-05 00:00:00, 2012-01-06 00:00:00, 2012-01-07 00:00:00, 2012-01-08 00:00:00, 2012-01-09 00:00:00, 2012-01-10 00:00:00, 2012-01-11 00:00:00, 2012-01-12 00:00:00, 2012-01-13 00:00:00, 2012-01-14 00:00:00, 2012-01-15 00:00:00, 2012-01-16 00:00:00, 2012-01-17 00:00:00, 2012-01-18 00:00:00, 2012-01-19 00:00:00, 2012-01-20 00:00:00, 2012-01-21 00:00:00, 2012-01-22 00:00:00, 2012-01-23 00:00:00, 2012-01-24 00:00:00, 2012-01-25 00:00:00, 2012-01-26 00:00:00, 2012-01-27 00:00:00, 2012-01-28 00:00:00, 2012-01-29 00:00:00, 2012-01-30 00:00:00, 2012-01-31 00:00:00, 2012-02-01 00:00:00, 2012-02-02 00:00:00, 2012-02-03 00:00:00, 2012-02-04 00:00:00, 2012-02-05 00:00:00, 2012-02-06 00:00:00, 2012-02-07 00:00:00, 2012-02-08 00:00:00, 2012-02-09 00:00:00, 2012-02-10 00:00:00, 2012-02-11 00:00:00, 2012-02-12 00:00:00, 2012-02-13 00:00:00, 2012-02-14 00:00:00, 2012-02-15 00:00:00, 2012-02-16 00:00:00, 2012-02-17 00:00:00, 2012-02-18 00:00:00, 2012-02-19 00:00:00, 2012-02-20 00:00:00, 2012-02-21 00:00:00, 2012-02-22 00:00:00, 2012-02-23 00:00:00, 2012-02-24 00:00:00, 2012-02-25 00:00:00, 2012-02-26 00:00:00, 2012-02-27 00:00:00, 2012-02-28 00:00:00, 2012-02-29 00:00:00, 2012-03-01 00:00:00, 2012-03-02 00:00:00, 2012-03-03 00:00:00, 2012-03-04 00:00:00, 2012-03-05 00:00:00, 2012-03-06 00:00:00, 2012-03-07 00:00:00, 2012-03-08 00:00:00, 2012-03-09 00:00:00, 2012-03-10 00:00:00, 2012-03-11 00:00:00, 2012-03-12 00:00:00, 2012-03-13 00:00:00, 2012-03-14 00:00:00, 2012-03-15 00:00:00, 2012-03-16 00:00:00, 2012-03-17 00:00:00, 2012-03-18 00:00:00, 2012-03-19 00:00:00, 2012-03-20 00:00:00, 2012-03-21 00:00:00, 2012-03-22 00:00:00, 2012-03-23 00:00:00, 2012-03-24 00:00:00, 2012-03-25 00:00:00, 2012-03-26 00:00:00, 2012-03-27 00:00:00, 2012-03-28 00:00:00, 2012-03-29 00:00:00, 2012-03-30 00:00:00, 2012-03-31 00:00:00, 2012-04-01 00:00:00, 2012-04-02 00:00:00, 2012-04-03 00:00:00, 2012-04-04 00:00:00, 2012-04-05 00:00:00, 2012-04-06 00:00:00, 2012-04-07 00:00:00, 2012-04-08 00:00:00, 2012-04-09 00:00:00, ...], [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], [0, 1, 2, 3, 4, 5, 6]])

In [68]:
# Print summary statistics
groupby_date_month_weekday.describe()

           Berri 1
count   310.000000
mean   2985.048387
std    2169.271062
min      32.000000
25%     596.000000
50%    3128.000000
75%    4973.250000
max    7077.000000

### Pivot Table

In [60]:
# Create a dataframe
new_df = berri_bikes.reset_index()

# Create a pivot table
new_df = new_df.pivot(index="Date", columns="month", values="Berri 1")
new_df

month          1   2   3   4   5   6   7   8   9   10      11
Date
2012-01-01   35.0 NaN NaN NaN NaN NaN NaN NaN NaN NaN     NaN
2012-01-02   83.0 NaN NaN NaN NaN NaN NaN NaN NaN NaN     NaN
2012-01-03  135.0 NaN NaN NaN NaN NaN NaN NaN NaN NaN     NaN
2012-01-04  144.0 NaN NaN NaN NaN NaN NaN NaN NaN NaN     NaN
2012-01-05  197.0 NaN NaN NaN NaN NaN NaN NaN NaN NaN     NaN
...           ...  ..  ..  ..  ..  ..  ..  ..  ..  ..     ...
2012-11-01    NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN  2405.0
2012-11-02    NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN  1582.0
2012-11-03    NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN   844.0
2012-11-04    NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN   966.0
2012-11-05    NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN  2247.0

[310 rows x 11 columns]

In [61]:
# Replace `NaN` with zero
new_df.fillna(0)

month          1    2    3    4    5    6    7    8    9    10      11
Date
2012-01-01   35.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0     0.0
2012-01-02   83.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0     0.0
2012-01-03  135.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0     0.0
2012-01-04  144.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0     0.0
2012-01-05  197.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0     0.0
...           ...  ...  ...  ...  ...  ...  ...  ...  ...  ...     ...
2012-11-01    0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  2405.0
2012-11-02    0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  1582.0
2012-11-03    0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0   844.0
2012-11-04    0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0   966.0
2012-11-05    0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  2247.0

[310 rows x 11 columns]

<br>

## Persistence

Data in a DataFrame can be saved to a file or a database. Lets look at both scenarios.

### Save to File

In [62]:
weekday_counts

           Berri 1
Monday      134298
Tuesday     135305
Wednesday   152972
Thursday    160131
Friday      141771
Saturday    101578
Sunday       99310

In [63]:
# Saves all the data including the index
weekday_counts.to_csv("datasets/bike_travel_weekday_count.csv")

In [64]:
df

  column1   column2 Gender  some_random_numbers  Location
0   Allen  Varghese   Male                 4200    Dublin
1   Kevin   O'Brien   Male                 2750  Limerick
2   Mihai     Todor   Male                 3820    Dublin

In [65]:
# Save DataFrame without index
df.to_csv("sample_dataset.csv", index=False)

### Save to Database

In [66]:
import sqlite3
db_conn = sqlite3.connect("workshop_db.sqlite")
df.to_sql("person_details", db_conn, if_exists="replace", index=False)

In [67]:
df_table = pd.read_sql("select * from person_details", db_conn)
df_table

  column1   column2 Gender  some_random_numbers  Location
0   Allen  Varghese   Male                 4200    Dublin
1   Kevin   O'Brien   Male                 2750  Limerick
2   Mihai     Todor   Male                 3820    Dublin